{"keras_version": "2.0.8", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [7, 7], "strides": [2, 2], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "conv1"}, "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn_conv1", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn_conv1"}, {"inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_1"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [3, 3], "trainable": false, "padding": "valid"}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res2a_branch2a"}, "name": "res2a_branch2a"}, {"inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2a_branch2a", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn2a_branch2a"}, {"inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_2"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "res2a_branch2b"}, "name": "res2a_branch2b"}, {"inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2a_branch2b", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn2a_branch2b"}, {"inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_3"}, "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res2a_branch2c"}, "name": "res2a_branch2c"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res2a_branch1"}, "name": "res2a_branch1"}, {"inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2a_branch2c", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn2a_branch2c"}, {"inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2a_branch1", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn2a_branch1"}, {"inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_1"}, "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_4"}, "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res2b_branch2a"}, "name": "res2b_branch2a"}, {"inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2b_branch2a", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn2b_branch2a"}, {"inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_5"}, "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "res2b_branch2b"}, "name": "res2b_branch2b"}, {"inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2b_branch2b", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn2b_branch2b"}, {"inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_6"}, "name": "activation_6"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res2b_branch2c"}, "name": "res2b_branch2c"}, {"inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2b_branch2c", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn2b_branch2c"}, {"inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_2"}, "name": "add_2"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_7"}, "name": "activation_7"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res2c_branch2a"}, "name": "res2c_branch2a"}, {"inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2c_branch2a", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn2c_branch2a"}, {"inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_8"}, "name": "activation_8"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "res2c_branch2b"}, "name": "res2c_branch2b"}, {"inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2c_branch2b", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn2c_branch2b"}, {"inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_9"}, "name": "activation_9"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res2c_branch2c"}, "name": "res2c_branch2c"}, {"inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn2c_branch2c", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn2c_branch2c"}, {"inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_3"}, "name": "add_3"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_10"}, "name": "activation_10"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res3a_branch2a"}, "name": "res3a_branch2a"}, {"inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3a_branch2a", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3a_branch2a"}, {"inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_11"}, "name": "activation_11"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "res3a_branch2b"}, "name": "res3a_branch2b"}, {"inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3a_branch2b", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3a_branch2b"}, {"inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_12"}, "name": "activation_12"}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 512, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res3a_branch2c"}, "name": "res3a_branch2c"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 512, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res3a_branch1"}, "name": "res3a_branch1"}, {"inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3a_branch2c", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3a_branch2c"}, {"inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3a_branch1", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3a_branch1"}, {"inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_4"}, "name": "add_4"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_13"}, "name": "activation_13"}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res3b_branch2a"}, "name": "res3b_branch2a"}, {"inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3b_branch2a", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3b_branch2a"}, {"inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_14"}, "name": "activation_14"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "res3b_branch2b"}, "name": "res3b_branch2b"}, {"inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3b_branch2b", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3b_branch2b"}, {"inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_15"}, "name": "activation_15"}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 512, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res3b_branch2c"}, "name": "res3b_branch2c"}, {"inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3b_branch2c", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3b_branch2c"}, {"inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_5"}, "name": "add_5"}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_16"}, "name": "activation_16"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res3c_branch2a"}, "name": "res3c_branch2a"}, {"inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3c_branch2a", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3c_branch2a"}, {"inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_17"}, "name": "activation_17"}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "res3c_branch2b"}, "name": "res3c_branch2b"}, {"inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3c_branch2b", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3c_branch2b"}, {"inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_18"}, "name": "activation_18"}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 512, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res3c_branch2c"}, "name": "res3c_branch2c"}, {"inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3c_branch2c", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3c_branch2c"}, {"inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_6"}, "name": "add_6"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_19"}, "name": "activation_19"}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res3d_branch2a"}, "name": "res3d_branch2a"}, {"inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3d_branch2a", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3d_branch2a"}, {"inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_20"}, "name": "activation_20"}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "res3d_branch2b"}, "name": "res3d_branch2b"}, {"inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3d_branch2b", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3d_branch2b"}, {"inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_21"}, "name": "activation_21"}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 512, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res3d_branch2c"}, "name": "res3d_branch2c"}, {"inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn3d_branch2c", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn3d_branch2c"}, {"inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_7"}, "name": "add_7"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_22"}, "name": "activation_22"}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res4a_branch2a"}, "name": "res4a_branch2a"}, {"inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn4a_branch2a", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn4a_branch2a"}, {"inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_23"}, "name": "activation_23"}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "res4a_branch2b"}, "name": "res4a_branch2b"}, {"inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn4a_branch2b", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn4a_branch2b"}, {"inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_24"}, "name": "activation_24"}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 1024, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res4a_branch2c"}, "name": "res4a_branch2c"}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 1024, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res4a_branch1"}, "name": "res4a_branch1"}, {"inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn4a_branch2c", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn4a_branch2c"}, {"inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn4a_branch1", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn4a_branch1"}, {"inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_8"}, "name": "add_8"}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_25"}, "name": "activation_25"}, {"inbound_nodes": [[["activation_25", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res4b_branch2a"}, "name": "res4b_branch2a"}, {"inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn4b_branch2a", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn4b_branch2a"}, {"inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_26"}, "name": "activation_26"}, {"inbound_nodes": [[["activation_26", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "res4b_branch2b"}, "name": "res4b_branch2b"}, {"inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn4b_branch2b", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn4b_branch2b"}, {"inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_27"}, "name": "activation_27"}, {"inbound_nodes": [[["activation_27", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 1024, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res4b_branch2c"}, "name": "res4b_branch2c"}, {"inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn4b_branch2c", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn4b_branch2c"}, {"inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_9"}, "name": "add_9"}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_28"}, "name": "activation_28"}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "name": "res4c_branch2a"}, "name": "res4c_branch2a"}, {"inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn4c_branch2a", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn4c_branch2a"}, {"inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_29"}, "name": "activation_29"}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 256, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "name": "res4c_branch2b"}, "name": "res4c_branch2b"}, {"inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "scale": true, "momentum": 0.99, "trainable": false, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn4c_branch2b", "center": true, "epsilon": 0.001, "gamma_regularizer": null, "axis": 3, "beta_regularizer": null}, "name": "bn4c_branch2b"}, {"inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": false, "name": "activation_30"}, "name": "activation_30"}, {"inbound_nodes": [[["activation_30", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "filters": 1024, "trainable": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, 